# 2장 자료타입 2023년 10월 24일 작성자 홍길동 -> 주석문
# 주석 fjdsalfjkladasjflkdasjflaksd 10월 24일 작성자 김해주 -> 주석문

a = 123  # 변수 a에 123을 저장했다.  ## C + / >> 필요 문단 주석 '=' -> 대입연산자
a = 100

a1 = 10

b = 1000
c = 10.5
d = -10

f = 0o166    # 8진수
f1 = 0b011   # 2진수
f2 = 0xa96   # 16진수

# kor = 10
# eng = 20

str1 = "Korea" #문자열을 저장할 때는 "" 또는 ''로 묶어야 한다.!
str2 = 'Japan'
str3 = '123' # 문자열로 인식

# t = "Korea" 문자(열)은 반드시 "" 또는 '' 묶은 후 저장해야 함.


# a == b 프로그래밍 언어에서 등호는 == 다

print(10 - 5)
print(10 % 3)  # % -> 나머지 연산자
print(10 / 3)
print(10 // 3) # // -> 몫 연산자

# 문자열 출력시 문장내 "" 혹은 '' 표시하는 방법
print('안녕하세요. 저는 "홍길동"입니다.!')
print("안녕하세요. 저는 '홍길동'입니다.!")
print("큰따옴표->\"")

# 선언할 때 유용함. 명령어 자동화 C + Space
print("안녕")
print(str1)
print("난 파이썬이야")

# 안녕
# 반가워
# 난 파이썬이야

print("안녕\n 반가워\t 난 파이썬이야") # \n은 그 위치에서 다음 줄로 이동 -> enter 입력과 같은 효과

# 안녕
# 반가워
# 난 파이썬이야














